snlkuharlocal/src/DataProcessors/ЗагрузкаСотрудниковИзЗуП_31/ЗагрузкаСотрудниковИзЗуП_31.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаСотрудниковИзЗуП_31</name>
  <attributes>
    <name>ГруппаФЛ_ЕЕ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исправлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>табВыплат</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>табВыплаты</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>Уволенные</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>фОтправлятьПисьмо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Загрузка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ЛицевыеСчетаРаботниковОрганизации/ЛицевыеСчетаРаботниковОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛицевыеСчетаРаботниковОрганизации</name>
  <resources>
    <name>НомерЛицевогоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыПодразделений/ВидыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПодразделений</name>
  <enumValues>
    <name>Торговое</name>
  </enumValues>
  <enumValues>
    <name>Управляющее</name>
  </enumValues>
  <enumValues>
    <name>Сервисное</name>
  </enumValues>
  <enumValues>
    <name>Франчайзинг</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/КлючиБезопасногоХранилищаДанных/КлючиБезопасногоХранилищаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиБезопасногоХранилищаДанных</name>
  <comment>// Ихсанов Д. А. 30.09.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2523</comment>
  <predefined>
    <items>
      <name>ДанныеDocFlowRabbitПлатежнаяИнформацияИсходящийПоток</name>
      <description>Данные doc flow rabbi платежная информация исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаВходящийПоток</name>
      <description>Данные doc flow rabbit банковские счета входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаВходящийПотокТест</name>
      <description>Данные doc flow rabbit банковские счета входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаИсходящийПоток</name>
      <description>Данные doc flow rabbit банковские счета исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаИсходящийПотокТест</name>
      <description>Данные doc flow rabbit банковские счета исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыВходящийПоток</name>
      <description>Данные doc flow rabbit договоры входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыВходящийПотокТест</name>
      <description>Данные doc flow rabbit договоры входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыИсходящийПоток</name>
      <description>Данные doc flow rabbit договоры исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыИсходящийПотокТест</name>
      <description>Данные doc flow rabbit договоры исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОВходящийПоток</name>
      <description>Данные doc flow rabbit ЗНО входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОВходящийПотокТест</name>
      <description>Данные doc flow rabbit ЗНО входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОИсходящийПоток</name>
      <description>Данные doc flow rabbit ЗНО исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОИсходящийПотокТест</name>
      <description>Данные doc flow rabbit ЗНО исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыВходящийПоток</name>
      <description>Данные doc flow rabbit контрагенты входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыВходящийПотокТест</name>
      <description>Данные doc flow rabbit контрагенты входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыИсходящийПоток</name>
      <description>Данные doc flow rabbit контрагенты исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыИсходящийПотокТест</name>
      <description>Данные doc flow rabbit контрагенты исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitПлатежнаяИнформацияИсходящийПотокТест</name>
      <description>Данные doc flow rabbit платежная информация исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеHTTPПубликацииSNL</name>
      <description>Данные HTTP публикации SNL</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPCollant</name>
      <description>Данные авторизации к FTP collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPWatcom</name>
      <description>Данные авторизации к FTP Watcom</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPКлиента</name>
      <description>Данные авторизации к FTP клиента</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPКонтур</name>
      <description>Данные авторизации к FTP контур</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPНаСайтеCollant</name>
      <description>Данные авторизации к FTP на сайте collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPСклада</name>
      <description>Данные авторизации к FTP Склада</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКHTTPОбмену</name>
      <description>Данные авторизации к http обмену</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКWebСервисуСклада</name>
      <description>Данные авторизации к web сервису склада</description>
    </items>
    <items>
      <name>ДанныеАвторизацииАрхивЛогов</name>
      <description>Данные авторизации к базе архива логов</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКЗУП_31</name>
      <description>Данные авторизации к ЗУП_31</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКЗУП_ЕЕ</name>
      <description>Данные авторизации к ЗУП_ЕЕ</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуХелпДеск</name>
      <description>Данные авторизации к почтовому серверу</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуRobot</name>
      <description>Данные авторизации к почтовому серверу robot</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуScud</name>
      <description>Данные авторизации к почтовому серверу scud</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуЕкод</name>
      <description>Данные авторизации к почтовому серверу Екод</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКСайтуCollant</name>
      <description>Данные авторизации к сайту Collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКСайтуIdexgroup</name>
      <description>Данные авторизации к сайту idexgroup</description>
    </items>
    <items>
      <name>ДанныеАвторизацииОзонТокен</name>
      <description>Данные авторизации озон токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииРВБ_БТК_Токен</name>
      <description>Данные авторизации РВБ БТК токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииРВБ_ЕЕЭ_Токен</name>
      <description>Данные авторизации РВБ ЕЕЭ токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииФормированиеБланкаSecretKey</name>
      <description>Данные авторизации формирование бранка Secret Key</description>
    </items>
    <items>
      <name>ПутьКФайлуОповещенияОбОшибкеТСД_RDP</name>
      <description>Путь к файлу оповещения об ошибке ТСД RDP</description>
    </items>
    <items>
      <name>ХранилищеДанныхS3</name>
      <description>Хранилище данных s3</description>
    </items>
  </predefined>
  <tabularSections>
    <name>ИспользуемыеТипыКлючей</name>
    <attributes>
      <name>ТипКлюча</name>
      <type>
        <types>EnumRef.ТипыКлючейБезопасногоХранилищаДанных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ЗагрузкаСотрудниковИзЗуП_31/ObjectModule.bsl
Перем База_Ист;

Перем СоответствиеТипов;
Перем СоответствиеПеречислений;
Перем СоответствиеТипов_Тек_Ист;

Функция ПолучитьПараметры() Экспорт
	ТП = Новый ТаблицаЗначений;
	ТП.Колонки.Добавить("Имя");
	ТП.Колонки.Добавить("Значение");
	
	СтрокаТП = ТП.Добавить(); СтрокаТП.Имя = "ИмяСервера"; 		СтрокаТП.Значение = "";
	СтрокаТП = ТП.Добавить(); СтрокаТП.Имя = "ИмяБазы"; 		СтрокаТП.Значение = "";
	
	//СтрокаТП = ТП.Добавить(); СтрокаТП.Имя = "Пользователь"; 	СтрокаТП.Значение = "Экспорт";
	//СтрокаТП = ТП.Добавить(); СтрокаТП.Имя = "Пароль"; 		СтрокаТП.Значение = "";
	
	СтрокаТП = ТП.Добавить(); СтрокаТП.Имя = "Организация";			СтрокаТП.Значение = Организация;
	СтрокаТП = ТП.Добавить(); СтрокаТП.Имя = "ГруппаФЛ_ЕЕ";			СтрокаТП.Значение = ГруппаФЛ_ЕЕ;
	СтрокаТП = ТП.Добавить(); СтрокаТП.Имя = "Уволенные";			СтрокаТП.Значение = Уволенные;	
	СтрокаТП = ТП.Добавить(); СтрокаТП.Имя = "фОтправлятьПисьмо";	СтрокаТП.Значение = Ложь;
	
	Возврат ТП;
КонецФункции //ПолучитьПараметры() Экспорт
 
Функция ЗагрузитьФЛ_Файл(СтрокаДанных) Экспорт
	Чтение = Новый ЧтениеXML();
	Чтение.УстановитьСтроку(СтрокаДанных);
	
	ТЗ = СериализаторXDTO.ПрочитатьXML(Чтение);
	
	ЗагрузитьФЛ(ТЗ);	
КонецФункции // ()

Функция ЗагрузитьФЛ_HTTP() Экспорт
	Результат	= Новый Структура("Успешно,Данные,Ошибки,Сообщения", Истина, Неопределено, Новый Массив, Новый Массив);
	резИст		= ПолучитьДанныеФЛчерезHTTP();	
	
	Если резИст.Успешно Тогда
		ЗагрузитьФЛ(резИст.Данные);
	Иначе
		ДобавитьОшибки(Результат, резИст);
	КонецЕсли;	
	
	Результат.Успешно = (Результат.Ошибки.Количество()=0); 
	Возврат Результат;
КонецФункции //ЗагрузитьФЛ_HTTP()

Функция ЗагрузитьЛС_HTTP() Экспорт
	Результат	= Новый Структура("Успешно,Данные,Ошибки,Сообщения,ЗагруженоОбъектов", Истина, Неопределено, Новый Массив, Новый Массив, 0);	
	
	резИст		= ПолучитьДанныеЛСчерезHTTP();	
	Если резИст.Успешно Тогда
		Результат = ЗагрузитьЛС(резИст.Данные);
	Иначе
		ДобавитьОшибки(Результат, резИст);
	КонецЕсли;	
	
	Результат.Успешно = (Результат.Ошибки.Количество()=0); 
	Возврат Результат;
КонецФункции //ЗагрузитьФЛ_HTTP()

Функция ПолучитьДанныеФЛчерезHTTP()
	Результат = Новый Структура("Успешно,Данные,Ошибки", Истина, Неопределено, Новый Массив);

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудник	
	|ПОМЕСТИТЬ ВТ_СотрудникиГПХ
	|ИЗ
	|	Документ.ДоговорРаботыУслуги
	|ГДЕ
	|	ДатаНачала>ДАТАВРЕМЯ(1980, 1, 1)
	|	И СпособРасчетовСФизическимиЛицами = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетовСФизическимиЛицами.РасчетыСКонтрагентами)	
	|;
	|ВЫБРАТЬ
	|	ТекКД.Сотрудник.Код					КАК КодЗуп,
	|	ТекКД.Сотрудник.Код					КАК ТабЗуп, //Нечаева. На кой надо ХЗ - но трогать страшно
	|	""EE""+ТекКД.ФизическоеЛицо.Код 	КАК Код,	
	|	ТекКД.ФизическоеЛицо.Наименование	КАК Наименование,
	|	""ES""+История.Подразделение.Код	КАК КодПодр,
	|	История.Подразделение.Наименование	КАК Подразделение,
	|	История.Должность.Наименование		КАК Должность,
	|	ТекКД.ДатаУвольнения				КАК ДатаУвольнения
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекКД
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ТекДата)	 КАК История
	|ПО
	|	История.Сотрудник = ТекКД.Сотрудник	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_СотрудникиГПХ
	|ПО
	|	ВТ_СотрудникиГПХ.Сотрудник = ТекКД.Сотрудник
	|ГДЕ
	|	ТекКД.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) 
	|	И ТекКД.ДатаПриема>=ДАТАВРЕМЯ(1, 1, 1) 
	|	И ВТ_СотрудникиГПХ.Сотрудник ЕСТЬ NULL
	|	И (
	|		ТекКД.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИЛИ НачалоПериода(ТекКД.ДатаУвольнения, ДЕНЬ) > &ТекДата
	|	)	
	|	И НЕ ТекКД.Сотрудник.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	ТекКД.ФизическоеЛицо.Наименование	
	|";
	
	Данные = Новый ТаблицаЗначений;
	
	пЗапроса = Новый Структура("ТекДата", ТекущаяДата());	
	резИст = ВыполнитьЗапросКИсточнику(ТекстЗапроса, пЗапроса);
	Если резИст.Успешно Тогда
		Результат.Данные = резИст.Данные;		
	Иначе
		Результат.Успешно = Ложь;
		ДобавитьОшибки(Результат, резИст);
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьДанныеФЛчерезHTTP()

Функция ПолучитьДанныеЛСчерезHTTP()
	Результат = Новый Структура("Успешно,Данные,Ошибки", Истина, Неопределено, Новый Массив);

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудник	
	|ПОМЕСТИТЬ ВТ_СотрудникиГПХ
	|ИЗ
	|	Документ.ДоговорРаботыУслуги
	|ГДЕ
	|	ДатаНачала>ДАТАВРЕМЯ(1980, 1, 1)
	|	И СпособРасчетовСФизическимиЛицами = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетовСФизическимиЛицами.РасчетыСКонтрагентами)	
	|;	
	|ВЫБРАТЬ	
	|	""EE""+ТекКД.ФизическоеЛицо.Код 	КАК ТабельныйНомер,	
	|	ТекКД.ФизическоеЛицо.Наименование	КАК ФИО,	
	|	ЛицевыеСчета.НомерЛицевогоСчета		КАК НомерЛицевогоСчета,	
	|	ЛицевыеСчета.ЗарплатныйПроект.Банк.Код			КАК Бик, 
	|	ЛицевыеСчета.ЗарплатныйПроект.Банк.ИНН			КАК Банк_ИНН, 
	|	ЛицевыеСчета.ЗарплатныйПроект.Банк.КоррСчет		КАК Банк_КоррСчет,
	|	ЛицевыеСчета.ЗарплатныйПроект.Банк.Наименование	КАК Банк_Наименование
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекКД
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ТекДата)	 КАК История
	|ПО
	|	История.Сотрудник = ТекКД.Сотрудник	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_СотрудникиГПХ
	|ПО
	|	ВТ_СотрудникиГПХ.Сотрудник = ТекКД.Сотрудник
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам КАК ЛицевыеСчета
	|ПО
	|	ТекКД.ФизическоеЛицо = ЛицевыеСчета.ФизическоеЛицо
	|ГДЕ
	|	ТекКД.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) 
	|	И ТекКД.ДатаПриема>=ДАТАВРЕМЯ(1, 1, 1) 
	|	И ВТ_СотрудникиГПХ.Сотрудник ЕСТЬ NULL
	|	И (
	|		ТекКД.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИЛИ НачалоПериода(ТекКД.ДатаУвольнения, ДЕНЬ) > &ТекДата
	|	)	
	|	И НЕ ТекКД.Сотрудник.ПометкаУдаления	
	|УПОРЯДОЧИТЬ ПО
	|	ФИО
	|";
	
	Данные = Новый ТаблицаЗначений;
	
	пЗапроса = Новый Структура("ТекДата", ТекущаяДата());	
	резИст = ВыполнитьЗапросКИсточнику(ТекстЗапроса, пЗапроса);
	Если резИст.Успешно Тогда
		Результат.Данные = резИст.Данные;		
	Иначе
		Результат.Успешно = Ложь;
		ДобавитьОшибки(Результат, резИст);
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьДанныеФЛчерезHTTP()

Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	ЗаписатьВЛог("Загрузка сотрудников", "Начало. Пользователь: "+ИмяПользователя()+", компьютер: "+ИмяКомпьютера(), "Информация");
	
	пОбработки = Новый Структура;
	
	СП = Новый Массив;
	Для Каждого СтрокаТП Из ТаблицаПараметров Цикл
		пОбработки.Вставить(СтрокаТП.Имя, СтрокаТП.Значение);	
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);  
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Пользователь = "*%*%*%";
	//Пароль		 = "*$*$*$";
	Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКЗУП_31).Логин;
	Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКЗУП_31).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	резЗагрузки = ЗагрузитьФЛ_HTTP();	
	Если НЕ резЗагрузки.Успешно Тогда
		ЗаписатьВЛог("Загрузка сотрудников", СтрСоединить(резЗагрузки.Ошибки, Символы.ПС), "Ошибки");		
	КонецЕсли; 
	
	резЗагрузки = ЗагрузитьЛС_HTTP();	
	Если резЗагрузки.Успешно Тогда		
		ЗаписатьВЛог("Загрузка лицевых счетов", "Загружено: "+резЗагрузки.ЗагруженоОбъектов+" ЛС.", "Информация");
	Иначе		
		ЗаписатьВЛог("Загрузка лицевых счетов", СтрСоединить(резЗагрузки.Ошибки, Символы.ПС), "Ошибки");		
	КонецЕсли;
	
	ЗаписатьВЛог("Загрузка сотрудников", "Окончание. Пользователь: "+ИмяПользователя()+", компьютер: "+ИмяКомпьютера(), "Информация");
КонецПроцедуры

Процедура ЗагрузитьФЛ(ТЗ)	
	Менеджер		= Справочники.ФизическиеЛица;
	
	СписокПринятых	= Новый Массив;
	СписокУволенных	= Новый Массив;	
	СписокКривых	= Новый Массив;
	
	СписокУзловПолучателей	= УзлыПолучатели();
	
	ИзмененияВДолжностях = Новый ТаблицаЗначений;
	ИзмененияВДолжностях.Колонки.Добавить("ФизЛицо");
	ИзмененияВДолжностях.Колонки.Добавить("ДолжностьНач");
	ИзмененияВДолжностях.Колонки.Добавить("ДолжностьКон");
	
	ЗагруженныеФЛ	= Новый Массив;
	Сч = 1;
	Для Каждого ТекСтрока Из ТЗ Цикл
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние(ТекСтрока.Наименование);
		#КонецЕсли
		
		ТабельныйНомер		= ТекСтрока.Код;
		КодГруппы 			= ТекСтрока.КодПодр;
		КодПодразделения	= Прав(КодГруппы, СтрДлина(КодГруппы)-2);		
		
		ФЛ_Ссылка 			= Менеджер.НайтиПоРеквизиту("ТабельныйНомер", ТабельныйНомер);
		
		//должность
		Должность = Справочники.Должности.НайтиПоНаименованию(ТекСтрока.Должность, Истина);
		Если Должность = Справочники.Должности.ПустаяСсылка() Тогда
			Должность = Справочники.Должности.СоздатьЭлемент();
			Должность.Наименование = ТекСтрока.должность;
			Должность.Записать();
			Должность = Должность.Ссылка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодГруппы) Тогда			
			ГруппаСсылка = Менеджер.НайтиПоРеквизиту("ТабельныйНомер", КодГруппы);
		Иначе
			ГруппаСсылка = Менеджер.ПустаяСсылка();				
		КонецЕсли;			

		Если ГруппаСсылка.Пустая() ИЛИ НЕ ГруппаСсылка.ЭтоГруппа  Тогда
			Если ЗначениеЗаполнено(КодГруппы) Тогда	
				ГруппаОбъект = Справочники.ФизическиеЛица.СоздатьГруппу();
				ГруппаОбъект.Наименование	= ТекСтрока.Подразделение;
				ГруппаОбъект.ТабельныйНомер	= ТекСтрока.КодПодр;
				ГруппаОбъект.Записать();
				
				ГруппаСсылка = ГруппаОбъект.Ссылка;
			
				ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей, ГруппаСсылка);					
			Иначе
				ГруппаСсылка = Менеджер.ПустаяСсылка();					
			КонецЕсли; 				
		КонецЕсли;
		
		Подразделение = Справочники.Подразделения.НайтиПоКоду(КодПодразделения);
		Если Подразделение.Пустая() Тогда
			#Если Клиент Тогда
				Сообщить("Нет найдено подразделение сотрудника: "+ТекСтрока.Наименование+". Код подр.: "+КодПодразделения);
			#КонецЕсли			
		КонецЕсли;		
		
		Если ФЛ_Ссылка.Пустая() Тогда			
			ФЛ_Объект = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ФЛ_Объект.ТабельныйНомер = ТабельныйНомер;			
		Иначе
			ФЛ_Объект	 = ФЛ_Ссылка.ПолучитьОбъект();			
		КонецЕсли;
		ЭтоНовый = ФЛ_Объект.Ссылка.Пустая();
		
		Если НЕ ЭтоНовый И ФЛ_Объект.Должность <> Должность 
			И (ЗначениеЗаполнено(ФЛ_Объект.Должность) ИЛИ ЗначениеЗаполнено(Должность)) Тогда
			СтрокаТ = ИзмененияВДолжностях.Добавить();		
			СтрокаТ.ФизЛицо 		= ФЛ_Объект.Наименование;
			СтрокаТ.ДолжностьНач	= ФЛ_Объект.Должность;
			СтрокаТ.ДолжностьКон	= Должность;
		КонецЕсли; 
		
		УстановитьНовоеЗначениеРеквизита(ФЛ_Объект, "Наименование", 	ТекСтрока.Наименование);
		УстановитьНовоеЗначениеРеквизита(ФЛ_Объект, "Родитель",			ГруппаСсылка);
		УстановитьНовоеЗначениеРеквизита(ФЛ_Объект, "Подразделение",	Подразделение);
		УстановитьНовоеЗначениеРеквизита(ФЛ_Объект, "Должность",		Должность);
		УстановитьНовоеЗначениеРеквизита(ФЛ_Объект, "Штатный",			Истина);
		УстановитьНовоеЗначениеРеквизита(ФЛ_Объект, "ТабельныйНомерСотрудникаЗУП",	ТекСтрока.ТабЗуп);		
		УстановитьНовоеЗначениеРеквизита(ФЛ_Объект, "ДатаУвольнения",	ТекСтрока.ДатаУвольнения);
		
		Если ФЛ_Объект.Модифицированность() Тогда				
			ФЛ_Объект.Записать();
				
			ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей, ФЛ_Объект);
			Если ЭтоНовый Тогда			
				СписокПринятых.Добавить(ФЛ_Объект.Ссылка);				
			КонецЕсли;			
		КонецЕсли;
		
		Если ПустаяСтрока(ФЛ_Объект.ШтрихКод) Тогда				
			ФЛ_Объект.ШтрихКод = ПолучитьШКФизЛица();
			#Если Клиент Тогда
				Сообщить("Прописан ШК " + ФЛ_Объект.Наименование+" "+ФЛ_Объект.ШтрихКод); 
			#КонецЕсли
			
			ФЛ_Объект.Записать();			
			ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей, ФЛ_Объект);
		КонецЕсли;
			
		ЗагруженныеФЛ.Добавить(ФЛ_Объект.Ссылка);
		Если ЭтоНовый Тогда
			#Если Клиент Тогда			
				Сообщить(Строка(ФЛ_Объект) + " // " + Строка(ФЛ_Объект.Родитель) + " принят");
			#КонецЕсли		
		КонецЕсли;		
		
		Если Подразделение.Пустая() Тогда			
			СписокКривых.Добавить(ФЛ_Объект.Ссылка);
		КонецЕсли;	
		
		Сч = Сч + 1;
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить("Загрузка списка сотрудников завершена.");
	#КонецЕсли
	
	//----------------------------------------------	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка	
	|ИЗ
	|	Справочник.ФизическиеЛица
	|ГДЕ
	|	ЭтоГруппа = Ложь	
	|	И Ссылка В ИЕРАРХИИ(&ГруппаФЛ_ЕЕ)
	|	И НЕ Ссылка В (&ЗагруженныеФЛ)
	|	И НЕ Ссылка В ИЕРАРХИИ (&Уволенные)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка.Наименование
	|";
	
	Запрос.УстановитьПараметр("ГруппаФЛ_ЕЕ", 	ГруппаФЛ_ЕЕ);
	Запрос.УстановитьПараметр("Уволенные", 		Уволенные);	
	Запрос.УстановитьПараметр("ЗагруженныеФЛ", 	ЗагруженныеФЛ);
	Запрос.УстановитьПараметр("НачалоДня", 		НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();			
		#КонецЕсли
		
		ФЛ_Объект = Выборка.Ссылка.ПолучитьОбъект();
		Если ФЛ_Объект.Штатный Тогда
			ФЛ_Объект.Штатный = Ложь;
		КонецЕсли;
						
		Если ФЛ_Объект.Родитель <> Уволенные Тогда
			ФЛ_Объект.Родитель	= Уволенные;
			ФЛ_Объект.Должность = Неопределено;
				
			#Если Клиент Тогда
				Сообщить(""+ФЛ_Объект + " // " + ФЛ_Объект.Родитель + " уволен");
			#КонецЕсли				
		КонецЕсли;
			
		Если ФЛ_Объект.Модифицированность() Тогда				
			ФЛ_Объект.Записать();
			ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей, ФЛ_Объект);
			
			СписокУволенных.Добавить(ФЛ_Объект.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	//письмо		
	//крохин начало 03.07.2019
	//загрузка лицевых счетов	
	#Если Клиент Тогда		
		Состояние("загрузка лицевых счетов");
	#КонецЕсли
	
	//ЗагрузитьЛицевыеСчета(ТекстПисьма);		
	
	ТекстПисьма = СоздатьТекстПисьма(СписокПринятых, СписокУволенных, СписокКривых, ИзмененияВДолжностях);
	Если фОтправлятьПисьмо И НЕ ПустаяСтрока(ТекстПисьма) Тогда
		ОтправитьПисьмо(ТекстПисьма, "Загрузка ФЛ из ЗуП.");	
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьНовоеЗначениеРеквизита(СпрОбъект, РеквИмя, РеквЗначение)
	Если СпрОбъект[РеквИмя]<>РеквЗначение Тогда
		СпрОбъект[РеквИмя] = РеквЗначение;	
	КонецЕсли;		
КонецПроцедуры

Функция СоздатьТекстПисьма(СписокПринятых, СписокУволенных, СписокКривых, ИзмененияВДолжностях)
	Тексты = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Наименование,Код,ТабельныйНомер,Подразделение ИЗ Справочник.ФизическиеЛица ГДЕ Ссылка В (&СписокСсылок)";
	
	Если СписокПринятых.Количество()>0 Тогда	
		Тексты.Добавить("ПРИНЯТЫ:");
		
		Запрос.УстановитьПараметр("СписокСсылок", СписокПринятых);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл		
			Тексты.Добавить(СтрШаблон("	Сотрудник: %1, ТН: %2, код: %3, подразделение: %4.", Выборка.Наименование, Выборка.ТабельныйНомер, Выборка.Код, Выборка.Подразделение));
		КонецЦикла;
	КонецЕсли; 
	
	Если СписокУволенных.Количество()>0 Тогда
		Тексты.Добавить("УВОЛЕНЫ:");
		
		Запрос.УстановитьПараметр("СписокСсылок", СписокУволенных);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Тексты.Добавить(СтрШаблон("	Сотрудник: %1, ТН: %2, код: %3, подразделение: %4.", Выборка.Наименование, Выборка.ТабельныйНомер, Выборка.Код, Выборка.Подразделение));
		КонецЦикла;
	КонецЕсли;	
	
	Если СписокКривых.Количество()>0 Тогда
		Тексты.Добавить("Неверное подразделение:");
		
		Запрос.УстановитьПараметр("СписокСсылок", СписокКривых);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Тексты.Добавить(СтрШаблон("	Сотрудник: %1, ТН: %2, код: %3.", Выборка.Наименование, Выборка.ТабельныйНомер, Выборка.Код));
		КонецЦикла;	
	КонецЕсли;
	
	Если ИзмененияВДолжностях.Количество()>0 Тогда
		ИзмененияВДолжностях.Сортировать("ФизЛицо");
		
		Тексты.Добавить("Изменены должности:");
	
		Для Каждого СтрокаТ Из ИзмененияВДолжностях Цикл
			Тексты.Добавить(СтрШаблон("	Сотрудник: %1, была должность: %2, стала: %3.", СтрокаТ.ФизЛицо, СтрокаТ.ДолжностьНач, СтрокаТ.ДолжностьНач));		
		КонецЦикла;
	КонецЕсли; 
	
	Возврат СтрСоединить(Тексты, Символы.ПС);
КонецФункции //СоздатьТекстПисьма(СписокПринятых, СписокУволенных, СписокКривых) 

Функция ЗагрузитьЛС(ДанныеЗуП)
	Результат	= Новый Структура("Успешно,Данные,Ошибки,Сообщения,ЗагруженоОбъектов", Истина, Неопределено, Новый Массив, Новый Массив, 0);
	
	ТекстПисьма = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ДанныеЗуП ИЗ &ДанныеЗуП КАК ДанныеЗуП ИНДЕКСИРОВАТЬ ПО ТабельныйНомер
	|;
	|ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка									КАК ФизЛицо,
	|	ФизическиеЛица.ТабельныйНомер							КАК ТабельныйНомер,
	|	ЛицевыеСчетаРаботниковОрганизации.НомерЛицевогоСчета 	КАК НомерЛС_Тек,
	|	ВТ_ДанныеЗуП.НомерЛицевогоСчета 						КАК НомерЛС_ЗуП,
	
	|	ЛицевыеСчетаРаботниковОрганизации.Банк.ИНН				КАК Банк_ИНН_Бух,	
	|	ВТ_ДанныеЗуП.Банк_ИНН			 						КАК Банк_ИНН_ЗуП
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
	|ПО 
	|	ЛицевыеСчетаРаботниковОрганизации.ФизЛицо = ФизическиеЛица.Ссылка
	|	И ЛицевыеСчетаРаботниковОрганизации.Организация = &Организация
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_ДанныеЗуП
	|ПО
	|	ФизическиеЛица.ТабельныйНомер = ВТ_ДанныеЗуП.ТабельныйНомер
	|ГДЕ
	|	ФизическиеЛица.Штатный
	|	И ФизическиеЛица.ТабельныйНомер<>"""" 
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДанныеЗуП", 		ДанныеЗуП);	
	Запрос.УстановитьПараметр("Организация", 	Организация);	
	
	Банки = Новый Соответствие;
	ЗагруженоЛС	= 0;	
	
	ШаблонСтроки = "%1	: %2, был ЛС: '%3', стал ЛС: '%4'.";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ТабельныйНомер) И ЗначениеЗаполнено(Выборка.НомерЛС_ЗуП) 
			И (Выборка.НомерЛС_Тек <> Выборка.НомерЛС_ЗуП ИЛИ Выборка.Банк_ИНН_Бух <> Выборка.Банк_ИНН_ЗуП) Тогда			
			ЗагруженоЛС = ЗагруженоЛС + 1;
			
			Результат.Сообщения.Добавить(СтрШаблон(ШаблонСтроки, 
				ЗагруженоЛС,
				Лев(""+Выборка.ФизЛицо		+ "                          ",40),
				//крохин начало 15.11.2023
				//номера ЛС писать не надо
				//Лев(""+Выборка.НомерЛС_Тек	+ "                          ",20), 
				//Выборка.НомерЛС_ЗуП)
				"", 
				"")
				//крохин конец 15.11.2023
			);
			
			Банк_ИНН_ЗуП = Выборка.Банк_ИНН_ЗуП;
			Если ЗначениеЗаполнено(Банк_ИНН_ЗуП) Тогда
				Банк = Банки[Банк_ИНН_ЗуП];
				Если Банк = Неопределено Тогда
					Банк = НайтиБанкПоИНН(Банк_ИНН_ЗуП);
					Банки[Банк_ИНН_ЗуП] = Банк;				
				КонецЕсли;
			Иначе
				Банк = Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;			
			
			Запись = РегистрыСведений.ЛицевыеСчетаРаботниковОрганизации.СоздатьМенеджерЗаписи();
			
			Запись.ФизЛицо 				= Выборка.ФизЛицо;						
			Запись.Организация			= Организация;			
			Запись.Банк					= Банк;
			Запись.НомерЛицевогоСчета 	= Выборка.НомерЛС_ЗуП;
			
			Запись.Записать();					
		КонецЕсли;	
	КонецЦикла;
	
	Если Результат.Сообщения.Количество()>0 Тогда
		ТекстПисьма = "Загружены ЛС физ лиц.
		|
		|	" + СтрСоединить(Результат.Сообщения, Символы.ПС+Символы.Таб);
		
		Если фОтправлятьПисьмо И НЕ ПустаяСтрока(ТекстПисьма) Тогда
			ОтправитьПисьмо(ТекстПисьма, "Загрузка ЛС из ЗуП.");		
		Иначе
			Сообщить(ТекстПисьма);
		КонецЕсли;			
	КонецЕсли; 
	
	Результат.Вставить("ЗагруженоОбъектов", ЗагруженоЛС);
	
	Возврат Результат;	
КонецФункции //ЗагрузитьЛС(ДанныеЗуП)

Функция НайтиБанкПоИНН(ИНН)        	       
	Результат = Справочники.Контрагенты.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		Если СокрЛП(ИНН) = "7707083893" Тогда //Сбербанк
			Результат = Справочники.Контрагенты.НайтиПоКоду("SSP-0564");
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ссылка
			|ИЗ
			|	Справочник.Контрагенты
			|ГДЕ
			|	ИНН = &ИНН
			|	И Владелец = &SSP
			|	И НЕ ПометкаУдаления	
			|УПОРЯДОЧИТЬ ПО
			|	Код	
			|";     
			
			Запрос.УстановитьПараметр("ИНН", СокрЛП(ИНН));
			Запрос.УстановитьПараметр("SSP", Справочники.ИБ.НайтиПоКоду("SSP"));
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				Результат = Выборка.Ссылка;					
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НайтиБанкПоИНН(ИНН)

Функция УзлыПолучатели()
	Запрос=Новый ("Запрос");
	Запрос.Текст="	
	|ВЫБРАТЬ
	|	Ссылка	
	|ИЗ
	|	ПланОбмена.Основной КАК Основной
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И НЕ Ссылка.Подразделение.ВидПодразделения = ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|	И НЕ ЭтотУзел	
	|";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции //УзлыПолучатели() 

Функция ПолучитьШКФизЛица()
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 4, 9) КАК НомерШК
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ 
	|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 1, 3)=""777""
	|УПОРЯДОЧИТЬ ПО 
	|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 4, 9) УБЫВ";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерШК =  Число(Выборка.НомерШК);	
	Иначе
		НомерШК = "000000000";
	КонецЕсли; 
	
	НомерШК=НомерШК+1;
	ШтрихКод = "777" + Формат(НомерШК,"ЧЦ=9; ЧРГ=; ЧВН=; ЧГ=0");
	ШтрихКод = ШтрихКод + КонтрольныйСимволEAN(Число(ШтрихКод),13);
	Возврат ШтрихКод;
КонецФункции

Процедура ОтправитьПисьмо(Текст, Тема) 
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(ПочтовыйПрофиль,ПараметрыПочты);	
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПочтовыйПрофиль.Пользователь       = "*%*%*%";
	//ПочтовыйПрофиль.Пароль             = "*$*$*$";
	ПочтовыйПрофиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	ПочтовыйПрофиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	ПочтовыйПрофиль.ВремяОжидания      = 60; 
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	
	
	Сообщение.Получатели.Добавить("krohin@collant.ru");	
	//крохин начало 15.11.2023
	//Сообщение.Получатели.Добавить("nikolaev@collant.ru");
	//крохин начало 29.09.2025
	//https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7230	
	//Сообщение.Получатели.Добавить("zhuravlev@collant.ru");
	//крохин конец 29.09.2025
	//крохин конец 15.11.2023
// Кухарь А.Ю.  21.02.2024 начало
 	Сообщение.Получатели.Добавить("kuhar@collant.ru");
// Кухарь А.Ю.  21.02.2024 конец

	//Феданченков М.С. 28.05.2026 Проблема 0000000008 начало
	//Сообщение.Получатели.Добавить("kovalenko@collant.ru");
	//Сообщение.Получатели.Добавить("afanasev_m@collant.ru");
	//Феданченков М.С. 28.05.2026 конец
	Сообщение.Получатели.Добавить("saraikina@collant.ru");
	Сообщение.Получатели.Добавить("ryabchenko@collant.ru");
	Сообщение.Получатели.Добавить("filippov@collant.ru");
	Сообщение.Получатели.Добавить("isec@collant.ru");
	
	Сообщение.Отправитель = "helpdesk@collant.ru";
	Сообщение.Тема = "Уведомление службы сопровождения пользователей департамента IT. "+Тема;
	Сообщение.Тексты.Добавить(Текст);
	
	Почта = Новый ИнтернетПочта(); 
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		Сообщить(ОписаниеОшибки()); 
		Возврат; 
	КонецПопытки; 
	
	Почта.Подключиться(ПочтовыйПрофиль);
	Почта.Послать(Сообщение);
	Почта.Отключиться();	
КонецПроцедуры	


#Область ЗагрузкаЧерезHTTPСервис
	

Функция ВыполнитьЗапросКИсточнику(Текст, Знач Параметры = Неопределено, ДопПараметры = Неопределено) Экспорт
	Результат	= Новый Структура("Успешно,Ошибки,Данные", Ложь, Новый Массив, Новый ТаблицаЗначений);
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;	
	КонецЕсли;
	
	ОписаниеЗапроса = Новый Структура("Текст,Параметры,ДопПараметры", Текст, Параметры, ДопПараметры);	
	
	СединениеХТТП = Новый HTTPСоединение(ИмяСервера, , Пользователь, Пароль);
	
	Запрос = Новый HTTPЗапрос(ИмяБазы+"/hs/EE_exchange/execute_query");	
	
	ВсегоСтрок	= 0;	
	Начало		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ДопСоответствиеТипов = ПолучитьЗначениеПараметра(ДопПараметры, "ДопСоответствиеТипов", Новый Соответствие);
	
	СтрокаХМЛ = ЗначениеВХМЛСтроку(ОписаниеЗапроса);
	ЗаменитьТипы_Тек_Ист(СтрокаХМЛ, ДопСоответствиеТипов);	
	Запрос.УстановитьТелоИзСтроки(СтрокаХМЛ);	
	
	Попытка
		Ответ = СединениеХТТП.ОтправитьДляОбработки(Запрос);
	Исключение
		Ответ		= Неопределено;
		ТекстОшибки	= СтрШаблон("Ошибка отправки запроса. Сервер: %1, база: %2. Ошибка: %3.", ИмяСервера, ИмяБазы, ОписаниеОшибки());
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецПопытки;		
	
	Если Ответ<>Неопределено Тогда		
		Если Ответ.КодСостояния = 200 Тогда	
			Тело			= Ответ.ПолучитьТелоКакСтроку();	
			Тело 			= ЗаменитьТипы_Ист_Тек(Тело);		
			
			Попытка
				резРазбора	= ЗначениеИзХМЛСтроки(Тело);
				
				Результат.Данные	= резРазбора.Данные;
				Результат.Успешно	= резРазбора.Успешно;
				Результат.Ошибки 	= резРазбора.Ошибки;
			Исключение
				Результат.Ошибки.Добавить("Ошибка разбора ответа ! "+ОписаниеОшибки()+" "+Лев(Тело, 1000));
				Результат.Успешно = Ложь;
			КонецПопытки;		
		Иначе
			Результат.Ошибки.Добавить("Ошибка обработки на сервере ! "+Ответ.КодСостояния);		
		КонецЕсли;
	КонецЕсли; 
	
	Результат.Успешно = (Результат.Ошибки.Количество()=0);
	
	Возврат Результат;
КонецФункции //ВыполнитьЗапросКИсточнику(Текст, Знач Параметры = Неопределено) Экспорт

Функция ЗначениеВХМЛСтроку(Значение)
	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьХМЛ, Значение, НазначениеТипаXML.Явное);	
	
	СтрокаХМЛ = ЗаписьХМЛ.Закрыть();	
	Возврат СтрокаХМЛ
КонецФункции //ЗначениеВХМЛСтроку(Значение)

Функция ЗначениеИзХМЛСтроки(СтрокаХМЛ) Экспорт
	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.УстановитьСтроку(СтрокаХМЛ);	
	
	Значение = СериализаторXDTO.ПрочитатьXML(ЧтениеХМЛ);	
	
	ЧтениеХМЛ.Закрыть();
	
	Возврат Значение;
КонецФункции //ЗначениеИзХМЛСтроки(СтрокаХМЛ)

Функция ЗаменитьТипы_Тек_Ист(СтрокаХМЛ, ДопСоответствиеТипов)
	Если ТипЗнч(ДопСоответствиеТипов)= Тип("Соответствие") Тогда //Иногда бывает 2 к 1
		Для Каждого КиЗ Из ДопСоответствиеТипов Цикл
			Если КиЗ.Ключ<>КиЗ.Значение Тогда				
		    	СтрокаХМЛ = СтрЗаменить(СтрокаХМЛ, КиЗ.Значение, КиЗ.Ключ);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
	Для Каждого КиЗ Из СоответствиеТипов Цикл
		Если КиЗ.Ключ<>КиЗ.Значение Тогда						
			Если КиЗ.Ключ<>"CatalogRef.ХарактеристикиНоменклатуры" Тогда			
				СтрокаХМЛ = СтрЗаменить(СтрокаХМЛ, КиЗ.Значение, КиЗ.Ключ);			
			КонецЕсли;		    
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат СтрокаХМЛ;
КонецФункции // ()

Функция ЗаменитьТипы_Ист_Тек(СтрокаХМЛ)
	Для Каждого КиЗ Из СоответствиеТипов Цикл
		Если КиЗ.Ключ<>КиЗ.Значение Тогда						
		    СтрокаХМЛ = СтрЗаменить(СтрокаХМЛ,КиЗ.Ключ, КиЗ.Значение);
		КонецЕсли;	
	КонецЦикла;
	Для Каждого КиЗ Из СоответствиеПеречислений Цикл
		Если КиЗ.Ключ<>КиЗ.Значение Тогда
			ЧастиИст = СтрРазделить(КиЗ.Ключ,".");
			ЧастиТек = СтрРазделить(КиЗ.Значение,".");
			
			СтрИст = ЧастиИст[0]+""">"+ЧастиИст[1]+"<";
			СтрТек = ЧастиТек[0]+""">"+ЧастиТек[1]+"<";
			
			//Элемент.Значение
			//<Value xmlns:d5p1="http://v8.1c.ru/8.1/data/enterprise/current-config" xsi:type="d5p1:EnumRef.ВидыОперацийПеремещениеТоваров">ТоварыПродукция</Value>
			//<Type xmlns:d4p1="http://v8.1c.ru/8.1/data/enterprise/current-config">d4p1:EnumRef.ВариантыОплатыЧекаККМ</Type>
		    СтрокаХМЛ = СтрЗаменить(СтрокаХМЛ, СтрИст, СтрТек);
			
			СтрИст	= ":EnumRef."+ЧастиИст[0]+"<";
			СтрТек	= ":EnumRef."+ЧастиТек[0]+"<";
			
			СтрокаХМЛ = СтрЗаменить(СтрокаХМЛ, СтрИст, СтрТек);
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат СтрокаХМЛ;
КонецФункции //ЗаменитьТипы_Ист_Ист(СтрокаХМЛ)

Функция СформироватьТестовыйЗапрос() Экспорт
	Текст = "
	|ВЫБРАТЬ 
	|	Наименование
	|ИЗ 
	|	Справочник.Организации
	|ГДЕ 
	|	Ссылка = &Организация
	|";
	
	Параметры = Новый Структура("Организация", Организация);
	
	Возврат Новый Структура("Текст,Параметры", Текст, Параметры);
КонецФункции //СформироватьТестовыйЗапрос()

Функция ТестСоединенияИст(ПараметрыПодключения = Неопределено) Экспорт
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыПодключения);
	
	Результат 		= Новый Структура("Успешно,Ошибки,Сообщения,Данные", Истина, Новый Массив, Новый Массив, Новый Массив);
	
	ТекстЗапроса 	= "ВЫБРАТЬ ПЕРВЫЕ 1 Наименование ИЗ Справочник.Организации ГДЕ НЕ ПометкаУдаления";
	резИст	 		= ВыполнитьЗапросКИсточнику(ТекстЗапроса);
	
	Если резИст.Успешно Тогда
		Данные = Новый Массив;
		Для Каждого СтрокаТД Из резИст.Данные Цикл
			Данные.Добавить(СтрокаТД.Наименование);	
		КонецЦикла;	
		Результат.Данные = Данные;		
	Иначе
		Результат.Успешно = Ложь;
		ДобавитьОшибки(Результат, резИст);
	КонецЕсли;
	
	Возврат Результат;		
КонецФункции


#КонецОбласти


Процедура ИнициализироватьГлобальныеПеременные()
	СоответствиеТипов			= СоответствиеТипов();
	СоответствиеТипов_Тек_Ист	= СоответствиеТипов_Тек_Ист(СоответствиеТипов);	
	СоответствиеПеречислений	= СоответствиеПеречислений();	
КонецПроцедуры

Функция СоответствиеТипов()
	СТ = Новый Соответствие;
	
	//СТ.Вставить("DocumentRef.АктПриемки",			"DocumentRef.АктОРасхождениях");
	//
	//СТ.Вставить("CatalogRef.Подразделения",		 	"CatalogRef.ПодразделенияОрганизаций");	
		//
	//СТ.Вставить("Characteristic.СвойстваОбъектов",				"Characteristic.ДополнительныеРеквизитыИСведения");
	//СТ.Вставить("ChartOfCharacteristicTypesRef.СвойстваОбъектов",	"ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения");	
	
	Возврат СТ;
КонецФункции //ПолучитьСоответствиеТипов()

Функция СоответствиеПеречислений()
	Результат = Новый Соответствие;
	
	Результат.Вставить("ТипыОплатЧекаККМ.Наличные",			"ТипыОплат.Наличные");
	Результат.Вставить("ТипыОплатЧекаККМ.ПлатежнаяКарта",	"ТипыОплат.ПлатежнаяКарта");	
	
	Возврат Результат;
КонецФункции // ()
 
Функция СоответствиеТипов_Тек_Ист(СоответствиеТипов)
	СТ = Новый Соответствие;
	Для Каждого КиЗ Из СоответствиеТипов Цикл
		СТ.Вставить(КиЗ.Значение, КиЗ.Ключ);	
	КонецЦикла;
	
	Возврат СТ;
КонецФункции //СоответствиеТипов_Тек_Ист(СоответствиеТипов)


Функция ДобавитьОшибки(Рез1, Рез2) Экспорт
	Если Рез1 = Рез2 Тогда //На всякий случай, а то уходит в даун
		Возврат Неопределено;	
	КонецЕсли; 
	Ошибки1 = ПолучитьЗначениеПараметра(Рез1, "Ошибки", Новый Массив);
	Ошибки2 = ПолучитьЗначениеПараметра(Рез2, "Ошибки", Новый Массив);
	
	Для Каждого ТекстОшибки Из Ошибки2 Цикл
		Ошибки1.Добавить(ТекстОшибки);		
	КонецЦикла; 
	
	УстановитьЗначениеПараметра(Рез1, "Ошибки", Ошибки1);	
КонецФункции //ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено) Экспорт

Функция ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено) Экспорт
	Результат	= ЗначениеПоУмолчанию;
	
	Если ТипЗнч(СтруктураПараметров)=Тип("Структура") Тогда
		ВремЗнач=Неопределено;
		Если СтруктураПараметров.Свойство(Имя,ВремЗнач) Тогда
			Результат	= ВремЗнач;		
		КонецЕсли; 
	ИначеЕсли ТипЗнч(СтруктураПараметров)=Тип("ДанныеФормыСтруктура") Тогда
		ВремЗнач=Неопределено;
		Если СтруктураПараметров.Свойство(Имя,ВремЗнач) Тогда
			Результат	= ВремЗнач;		
		КонецЕсли; 
	ИначеЕсли ТипЗнч(СтруктураПараметров)=Тип("Соответствие") Тогда
		ВремЗнач=СтруктураПараметров.Получить(Имя);
		Если ВремЗнач<>Неопределено Тогда
			Результат=ВремЗнач;		
		КонецЕсли;				
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено) Экспорт

Функция УстановитьЗначениеПараметра(СтруктураПараметров,Имя,Значение,Перезаписывать=Истина) Экспорт	
	
	Результат = Ложь;
	
	Если 
		ТипЗнч(СтруктураПараметров)=Тип("Структура") ИЛИ 
		ТипЗнч(СтруктураПараметров)=Тип("Соответствие") Тогда
		
		ТекЗнач=ПолучитьЗначениеПараметра(СтруктураПараметров,Имя);
		Если ТекЗнач=Неопределено ИЛИ (ТекЗнач<>Значение И Перезаписывать) Тогда
			СтруктураПараметров.Вставить(Имя,Значение);		
			Результат = Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //УстановитьЗначениеПараметра(СтруктураПараметров,Имя,Значение,Перезаписывать=Истина) Экспорт

ИнициализироватьГлобальныеПеременные();

Организация = Справочники.Организации.НайтиПоКоду("SS-001");
ГруппаФЛ_ЕЕ = Справочники.ФизическиеЛица.НайтиПоКоду("SNL-00849");
Уволенные 	= Справочники.ФизическиеЛица.НайтиПоКоду("SNL-00918");
